glcloud/keil_v5/ARM/PACK/.Web/Keil.S32K116_SDK_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <name>S32K116_SDK_DFP</name>
  <description>NXP S32K116 SDK including S32K116 basic CMSIS Device Support</description>
  <url>http://www.keil.com/pack/</url>

  <releases>
    <release version="1.0.0" date="2018-06-28">
      Initial version of NXP S32K116 Device Family Pack
      - based on the NXP Software Development Kit for S32K116 Version 1.8.7.
      - example project for S32K116-EVB FRDM Board
      - patched device include file (CMSIS also for ARMCC, GCC, IAR).
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>S32</keyword>
  </keywords>

  <devices>
    <family Dfamily="S32K Series" Dvendor="NXP:11">
      <description>
The NXP S32K product series of 32-bit automotive microcontrollers provides a highly integrated, low-power, safe and secure single-chip solution.
The combination of fast CPU with flexible low-power modes and the low-leakage technology process will not force any compromises on performance relative to low-power.
Our combined Cortex® M0+ and M4-based automotive MCU offerings span a broad memory space and include package options from 8 K to 2 MByte with 16 to 176 pins initially.
The ARM® Cortex M4 core architecture includes an IEEE-754 compliant single precision Floating Point Unit (FPU) with DSP functions unleashing the full potential of model-based design flows.
      </description>

      <environment name="uv">
        <CMisc>--C99</CMisc>
      </environment>

      <!-- ******************************  Subfamily 'S32K11x'  ****************************** -->
      <subFamily DsubFamily="S32K11x">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian"/>

        <book name="addon_mdk/Documents/DUI0662B_cortex_m0p_r0p1_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
        <book name="addon_mdk/Documents/S32K-RM.pdf"                       title="S32K1xx Series Reference Manual"/>
        <book name="addon_mdk/Documents/S32K-DS.pdf"                       title="S32K1xx Data Sheet"/>

        <!-- ******************************  Device 'S32K116'  ****************************** -->
        <device Dname="S32K116">
          <compile header="platform/devices/device_registers.h"/> <!-- generates warning in PackCheck because name is not CMSIS conform -->
          <compile define="CPU_S32K116"/>
          <debug  svd="platform/devices/S32K116/S32K116.svd"/>
          <memory id="IROM1"                                           start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <algorithm name="addon_cmsis/Flash/S32K116_P128_2KB_SEC.FLM" start="0x00000000" size="0x00020000" default="1"/>

          <!-- *********************** -->
          <!-- 48MHz 48LQFP -->
          <variant Dvariant="S32K116xxxxMLFx">
            <processor Dclock="48000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00002000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x20002000" size="0x00001800" init   ="0" default="0"/>
            <feature type="QFP" n="48"/>
          </variant>
          <variant Dvariant="S32K116xxxxVLFx">
            <processor Dclock="48000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00002000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x20002000" size="0x00001800" init   ="0" default="0"/>
            <feature type="QFP" n="48"/>
          </variant>

          <!-- 48MHz 32QFN -->
          <variant Dvariant="S32K116xxxxMFMx">
            <processor Dclock="48000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00002000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x20002000" size="0x00001800" init   ="0" default="0"/>
            <feature type="QFN" n="32"/>
          </variant>
          <variant Dvariant="S32K116xxxxVFMx">
            <processor Dclock="48000000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00002000" init   ="0" default="1"/>
            <memory id="IRAM2" start="0x20002000" size="0x00001800" init   ="0" default="0"/>
            <feature type="QFN" n="32"/>
          </variant>
        </device>

      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- one condition for each device -->
    <condition id="S32K116">
      <description>NXP S32K116 device</description>
      <accept Dvendor="NXP:11" Dname="S32K116*"/>
    </condition>

    <!-- one condition for each device group with same coreclock/Startup -->
    <condition id="S32K11x">
      <description>NXP S32K11x devices</description>
      <accept condition="S32K116"/>
      <!--accept condition="next device with same coreclock"/-->
    </condition>

    <!-- one condition for device subfamily + CMSIS -->
    <condition id="S32K11x_CMSIS">
      <description>NXP S32K11x devices and CMSIS-CORE</description>
      <accept condition="S32K11x"/>
       <!--accept condition="next devices group within same subfamily"/-->
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <!-- one condition for device subfamily + CMSIS -->
    <condition id="S32K116_CMSIS">
      <description>NXP S32K116 devices and CMSIS-CORE</description>
      <accept condition="S32K116"/>
       <!--accept condition="next devices group within same subfamily"/-->
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- one condition for all devices in this pack -->
    <condition id="S32K">
      <description>NXP S32K device and CMSIS-CORE</description>
      <accept condition="S32K11x_CMSIS"/>
      <!--accept condition="next subfamily"/-->
    </condition>

    <!--condition id="S32K Unknown">
      <description>NXP S32K unknown device and CMSIS-CORE</description>
      <require Dvendor="NXP:11" Dname="S32Kxxx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition-->

    <condition id="AC5">
      <description>ARM compiler</description>
      <require Tcompiler="ARMCC" Toptions="AC5"/>
    </condition>
