glcloud/keil_v5/ARM/PACK/.Web/Keil.S32K116_SDK_DFP.pdsc
    <condition id="AC6">
      <description>ARM compiler</description>
      <require Tcompiler="ARMCC" Toptions="AC6"/>
    </condition>
    <condition id="GCC">
      <description>GCC compiler</description>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="IAR">
      <description>IAR compiler</description>
      <require Tcompiler="IAR"/>
    </condition>

    <!-- bundle dependencies -->
    <condition id="S32K116 DRV_CLOCK_PINS">
      <description>NXP S32K Driver Clock Pins dependency</description>
      <require condition="S32K116"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="PINS"/>
    </condition>
    <condition id="S32K116 DRV_CLOCK_PINS_ADC">
      <description>NXP S32K Driver Clock Pins ADC dependency</description>
      <require condition="S32K116"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="PINS"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="ADC"/>
    </condition>

    <condition id="S32K DRV_ADC">
      <description>NXP S32K Driver ADC dependency</description>
      <require condition="S32K"/>
    </condition>
    <condition id="S32K DRV_Clock">
      <description>NXP S32K System Clock dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>
    <condition id="S32K DRV_CMP">
      <description>NXP S32K Driver CMP dependency</description>
      <require condition="S32K"/>
    </condition>
    <condition id="S32K DRV_CRC">
      <description>NXP S32K Driver CRC dependency</description>
      <require condition="S32K"/>
    </condition>
    <condition id="S32K DRV_CSEC">
      <description>NXP S32K Driver CSEC dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>
    <condition id="S32K DRV_EDMA">
      <description>NXP S32K Driver eDMA dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>
    <condition id="S32K DRV_EIM">
      <description>NXP S32K Driver EIM dependency</description>
      <require condition="S32K"/>
    </condition>
    <condition id="S32K DRV_ERM">
      <description>NXP S32K Driver ERM dependency</description>
      <require condition="S32K"/>
    </condition>
    <condition id="S32K DRV_EWM">
      <description>NXP S32K Driver EWM dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>
    <condition id="S32K DRV_FTM">
      <description>NXP S32K Driver FTM dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>
    <condition id="S32K DRV_FTM_IC">
      <description>NXP S32K Driver FTM dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FTM"/>
    </condition>
    <condition id="S32K DRV_FTM_MC">
      <description>NXP S32K Driver FTM dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FTM"/>
    </condition>
    <condition id="S32K DRV_FTM_OC">
      <description>NXP S32K Driver FTM dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FTM"/>
    </condition>
    <condition id="S32K DRV_FTM_PWM">
      <description>NXP S32K Driver FTM dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FTM"/>
    </condition>
    <condition id="S32K DRV_FTM_QD">
      <description>NXP S32K Driver FTM dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FTM"/>
    </condition>
    <condition id="S32K DRV_FlexCAN">
      <description>NXP S32K Driver FlexCAN dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K DRV_FlexIO">
      <description>NXP S32K Driver FLEXIO dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K DRV_FlexIO_I2C">
      <description>NXP S32K Driver FLEXIO I2C dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="S32K DRV_FlexIO_I2S">
      <description>NXP S32K Driver FLEXIO I2S dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="S32K DRV_FlexIO_SPI">
      <description>NXP S32K Driver FLEXIO SPI dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="S32K DRV_FlexIO_UART">
      <description>NXP S32K Driver FLEXIO UART dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="S32K DRV_LIN">
      <description>NXP S32K Driver LIN dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="LPUART"/>
    </condition>
    <condition id="S32K DRV_LPI2C">
      <description>NXP S32K Driver LPI2C dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K DRV_LPIT">
      <description>NXP S32K Driver LPIT dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>
    <condition id="S32K DRV_LPSPI">
      <description>NXP S32K Driver LPSPI dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
